tap "clojure-lsp/brew"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "oven-sh/bun"
tap "petere/postgresql"
tap "universal-ctags/universal-ctags"
tap "xcodesorg/made"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "jpeg-turbo"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "gdk-pixbuf"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "aften"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "aribb24"
brew "ca-certificates"
brew "mpdecimal"
brew "openssl@3"
brew "python-psutil"
brew "readline"
brew "sqlite"
brew "python@3.12"
brew "six"
brew "asitop"
brew "aspell"
brew "atk"
brew "m4"
brew "autoconf"
brew "automake"
brew "berkeley-db"
brew "bison"
brew "python-packaging"
brew "black"
brew "boost"
brew "bottom"
brew "c-ares"
brew "pycparser"
brew "python-setuptools"
brew "cffi"
brew "cjson"
brew "libsigsegv"
brew "clisp"
brew "rlwrap"
brew "clojure"
brew "openjdk@11"
brew "clojure-lsp"
brew "cmake"
brew "cmake-docs"
brew "gmp"
brew "coreutils"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "dav1d"
brew "dbus"
brew "deno"
brew "docker-completion"
brew "docker"
brew "docker-buildx"
brew "docker-clean"
brew "docker-compose"
brew "docutils"
brew "duf"
brew "elvish"
brew "enchant"
brew "fd"
brew "findutils"
brew "ncurses"
brew "fish"
brew "libogg"
brew "flac"
brew "fnm"
brew "frei0r"
brew "fzf"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gcc@11"
brew "libavif"
brew "gd"
brew "gdbm"
brew "gh"
brew "ghc"
brew "ghcup"
brew "jbig2dec"
brew "libidn"
brew "openjpeg"
brew "ghostscript"
brew "git"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "pkg-config"
brew "gobject-introspection"
brew "gpgme"
brew "gsettings-desktop-schemas"
brew "hicolor-icon-theme"
brew "libepoxy"
brew "gtk+3"
brew "gtk-mac-integration"
brew "gspell"
brew "gtksourceview4"
brew "json-glib"
brew "libdazzle"
brew "libgee"
brew "libgit2"
brew "libgit2-glib"
brew "libhandy"
brew "py3cairo"
brew "pygobject3"
brew "libpeas"
brew "libsecret"
brew "gitg"
brew "gitui"
brew "glew"
brew "glm"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "go@1.20"
brew "gpatch"
brew "jasper"
brew "netpbm"
brew "gts"
brew "libtool"
brew "graphviz"
brew "grep"
brew "helix"
brew "lua"
brew "highlight"
brew "htop"
brew "libde265"
brew "shared-mime-info"
brew "x265"
brew "libheif"
brew "liblqr"
brew "libomp"
brew "libraw"
brew "imagemagick"
brew "intltool"
brew "pygments"
brew "ipython"
brew "jansson"
brew "jless"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "libuv"
brew "mypy"
brew "node"
brew "pandoc"
brew "pydocstyle"
brew "python-certifi"
brew "python-markupsafe"
brew "python-jinja"
brew "ruff"
brew "jupyterlab"
brew "kubernetes-cli"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "libgccjit"
brew "libgit2@1.6"
brew "liblinear"
brew "libmicrohttpd"
brew "libmpeg2"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsoxr"
brew "libtermkey"
brew "libvidstab"
brew "libvpx"
brew "libvterm"
brew "llvm"
brew "llvm@11"
brew "llvm@12"
brew "llvm@16"
brew "lpeg"
brew "lsd"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "luv"
brew "make"
brew "mbedtls@2"
brew "mdbook"
brew "meson"
brew "minikube"
brew "mkdocs"
brew "mp3val"
brew "mpck"
brew "msgpack"
brew "ncdu"
brew "neovim"
brew "nushell"
brew "opam"
brew "openblas"
brew "opencore-amr"
brew "openjdk@17"
brew "openlibm"
brew "p7zip"
brew "pastel"
brew "pcre"
brew "perl"
brew "pnpm"
brew "portaudio"
brew "powerlevel10k"
brew "pyenv"
brew "python-brotli"
brew "python-mutagen"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "rav1e"
brew "ripgrep"
brew "rubberband"
brew "ruby"
brew "rust"
brew "sbcl"
brew "sdl2_image"
brew "snappy"
brew "speedtest-cli"
brew "speex"
brew "srt"
brew "starship"
brew "svt-av1"
brew "tesseract"
brew "texinfo"
brew "theora"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vala"
brew "vapor"
brew "vivid"
brew "wget"
brew "x264"
brew "xcodegen"
brew "xcodes"
brew "xplr"
brew "xvid"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp"
brew "zig"
brew "zimg"
brew "zlib"
brew "zola"
brew "clojure-lsp/brew/clojure-lsp-native", link: false
brew "oven-sh/bun/bun"
vscode "FaroSystemAppender constructor"
vscode "1YiB.rust-bundle"
vscode "aerokaido.three-js-snippets"
vscode "afractal.node-essentials"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alefragnani.project-manager"
vscode "Angular.ng-template"
vscode "anseki.vscode-color"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "ardenivanov.svelte-intellisense"
vscode "arzg.rustdoc-theme"
vscode "austin.code-gnu-global"
vscode "Autodesk.autolispext"
vscode "axmz.color-assist"
vscode "azemoh.one-monokai"
vscode "b3hr4d.colorful-darkplus"
vscode "batisteo.vscode-django"
vscode "bbenoist.Nix"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "benjaminbenais.copilot-theme"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "blanu.vscode-styled-jsx"
vscode "bmalehorn.vscode-fish"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "capaj.vscode-standardjs-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "danielpinto8zz6.c-cpp-project-generator"
vscode "DanielSanMedium.dscodegpt"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.intelli-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "dfarley1.file-picker"
vscode "Divlo.vscode-styled-jsx-syntax"
vscode "dlahmad.dracula-for-rust-theme"
vscode "dline.CobaltNext"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "DSnake.java-debug"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.dark-plus-syntax"
vscode "dustypomerleau.rust-syntax"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "eg2.vscode-npm-script"
vscode "En10ve.threejs"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "felipecaputo.git-project-manager"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "foxundermoon.next-js"
vscode "foxundermoon.shell-format"
vscode "gamunu.vscode-yarn"
vscode "genieai.chatgpt-vscode"
vscode "george3447.docker-run"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "GraebertGmbH.flisp"
vscode "GrapeCity.gc-excelviewer"
vscode "hars.CppSnippets"
vscode "haskell.haskell"
vscode "hediet.vscode-drawio"
vscode "henriiik.docker-linter"
vscode "hoangnc.io-run"
vscode "hoovercj.haskell-linter"
vscode "imjacobclark.vscode-lisp-formatter"
vscode "infeng.vscode-react-typescript"
vscode "jacobdufault.fuzzy-search"
vscode "jaredly.reason-vscode"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jinxdash.prettier-rust"
vscode "johnpapa.Angular2"
vscode "josetr.cmake-language-support-vscode"
vscode "jprestidge.theme-material-theme"
vscode "JScearcy.rust-doc-viewer"
vscode "julialang.language-julia"
vscode "justusadam.language-haskell"
vscode "kahole.magit"
vscode "KevinRose.vsc-python-indent"
vscode "kuscamara.electron"
vscode "leizongmin.node-module-intellisense"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "LukasFend.comfyeyes-theme"
vscode "magnobiet.docker-extension-pack"
vscode "mattn.Lisp"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.Theme-MarkdownKit"
vscode "ms-vscode.Theme-MaterialKit"
vscode "ms-vscode.vs-keybindings"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "naumovs.theme-oceanicnext"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "p1c2u.docker-compose"
vscode "panicbit.cargo"
vscode "PKief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pomdtr.excalidraw-editor"
vscode "pranaygp.vscode-css-peek"
vscode "qingpeng.common-lisp"
vscode "QuentinGruber.dockerfiletemplate"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.ruby"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rheller.alive"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sburg.vscode-javascript-booster"
vscode "sdras.night-owl"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "sswg.swift-lang"
vscode "standard.vscode-standard"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "teabyii.ayu"
vscode "thenikso.github-plus-theme"
vscode "threeninenineone.flux"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "VirejDasani.hydroxy"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "VSpaceCode.whichkey"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WallabyJs.quokka-vscode"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "whtouche.vscode-js-console-utils"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "xabikos.ReactSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "ZhangYue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
vscode "Zignd.html-css-class-completion"
